#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ecr_authorization_token.token: Reading...
module.lambda_function_with_docker_build.data.aws_region.current: Reading...
module.docker_build.data.aws_caller_identity.this: Reading...
module.docker_build.data.aws_region.current: Reading...
module.lambda_function_with_docker_build.data.aws_caller_identity.current: Reading...
module.lambda_function_with_docker_build.data.aws_partition.current: Reading...
data.aws_region.current: Reading...
data.aws_caller_identity.this: Reading...
module.lambda_function_with_docker_build.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/python-awslambda-template]
module.docker_build.aws_ecr_repository.this[0]: Refreshing state... [id=python-awslambda-template]
module.lambda_function_with_docker_build.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_function_with_docker_build.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.docker_build.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_function_with_docker_build.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_function_with_docker_build.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lambda_function_with_docker_build.aws_iam_role.lambda[0]: Refreshing state... [id=python-awslambda-template]
module.docker_build.data.aws_caller_identity.this: Read complete after 0s [id=944523251195]
data.aws_caller_identity.this: Read complete after 0s [id=944523251195]
module.lambda_function_with_docker_build.data.aws_caller_identity.current: Read complete after 0s [id=944523251195]
data.aws_ecr_authorization_token.token: Read complete after 0s [id=us-east-1]
module.lambda_function_with_docker_build.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_function_with_docker_build.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3776207156]
module.lambda_function_with_docker_build.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::944523251195:policy/python-awslambda-template-logs]
module.docker_build.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=python-awslambda-template]
module.docker_build.docker_image.this: Refreshing state... [id=sha256:77c46c209a3cf2055d3bc25510baf84bf2efb713b842dfbd374a10f770f37fc2944523251195.dkr.ecr.us-east-1.amazonaws.com/python-awslambda-template]
module.docker_build.docker_registry_image.this: Refreshing state... [id=sha256:1e0d2c901a7e6cb85b121c7be509a6760f07a7cf1facc865207468cbb891b59b]
module.lambda_function_with_docker_build.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=python-awslambda-template-20240507153616151300000001]
module.lambda_function_with_docker_build.aws_lambda_function.this[0]: Refreshing state... [id=python-awslambda-template]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.docker_build.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:77c46c209a3cf2055d3bc25510baf84bf2efb713b842dfbd374a10f770f37fc2944523251195.dkr.ecr.us-east-1.amazonaws.com/python-awslambda-template"
      - name         = "944523251195.dkr.ecr.us-east-1.amazonaws.com/python-awslambda-template" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.docker_build.aws_ecr_repository.this[0] will be updated in-place
  ~ resource "aws_ecr_repository" "this" {
        id                   = "python-awslambda-template"
        name                 = "python-awslambda-template"
        tags                 = {}
      ~ tags_all             = {
          + "owner"   = "xtutran"
          + "repo"    = "https://github.com/xtutran/python-awslambda-template"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.docker_build.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "944523251195.dkr.ecr.us-east-1.amazonaws.com/python-awslambda-template"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "2e799a20a68700b836304d3c0dd615d79a6e8516"
        }

      + build {
          + cache_from   = []
          + context      = "../"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + platform     = "linux/amd64"
          + remove       = true
          + security_opt = []
          + tag          = []
        }
    }

  # module.lambda_function_with_docker_build.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/python-awslambda-template"
        name              = "/aws/lambda/python-awslambda-template"
        tags              = {}
      ~ tags_all          = {
          + "owner"   = "xtutran"
          + "repo"    = "https://github.com/xtutran/python-awslambda-template"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function_with_docker_build.aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id               = "arn:aws:iam::944523251195:policy/python-awslambda-template-logs"
        name             = "python-awslambda-template-logs"
        tags             = {}
      ~ tags_all         = {
          + "owner"   = "xtutran"
          + "repo"    = "https://github.com/xtutran/python-awslambda-template"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function_with_docker_build.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "python-awslambda-template"
        name                  = "python-awslambda-template"
        tags                  = {}
      ~ tags_all              = {
          + "owner"   = "xtutran"
          + "repo"    = "https://github.com/xtutran/python-awslambda-template"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.lambda_function_with_docker_build.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "python-awslambda-template"
        tags                           = {}
      ~ tags_all                       = {
          + "owner"   = "xtutran"
          + "repo"    = "https://github.com/xtutran/python-awslambda-template"
            # (1 unchanged element hidden)
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @xtutran, Action: `pull_request`*